/*正则类型
** 1.用于辅助new StringField().regexp(ReType.idCard)效验
** 2.用于标识字段类型，以便在代码生成时根据Field.attributes.regexp[i]==RegExpType.idCard实现更具体的效验
**/
export const Type = {
  /** 身份证(只做最基本的效验，进一步效验请在代码生成的根据Field.attributes.regexp[i]==RegExpType.idCard实现)
      // 第一位不可能是0
      // 第二位到第六位可以是0-9
      // 第七位到第十位是年份，所以七八位为19或者20
      // 十一位和十二位是月份，这两位是01-12之间的数值
      // 十三位和十四位是日期，是从01-31之间的数值
      // 十五，十六，十七都是数字0-9
      // 十八位可能是数字0-9，也可能是X(大写)
      如110101199001013398或11010119900101581X(大写)
    */
  idCard:
    /^[1-9][0-9]{5}([1][9][0-9]{2}|[2][0][0|1][0-9])([0][1-9]|[1][0|1|2])([0][1-9]|[1|2][0-9]|[3][0|1])[0-9]{3}([0-9]|[X])$/,
  /** 12位行政区划码,如520115000000(以0补足12位 */
  addressCode: /^[1-8]{1}[0-7]{1}[0-9]{4,10}$/,
  /** 18位统一社会信用代码,如1210000040077753X1(字母大写),参考GB 32100 */
  uniformSocialCreditCode: /^[^_IOZSVa-z\W]{2}\d{6}[^_IOZSVa-z\W]{10}$/,
  /** email地址,如admin@qq.com */
  email:
    /^(([^<>()[\]\\.,;:\s@\"]+(\.[^<>()[\]\\.,;:\s@\"]+)*)|(\".+\"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  /** url,如https://www.baidu.com */
  url:
    /((([A-Za-z]{3,9}:(?:\/\/)?)(?:[-;:&=\+\$,\w]+@)?[A-Za-z0-9.-]+|(?:www.|[-;:&=\+\$,\w]+@)[A-Za-z0-9.-]+)((?:\/[\+~%\/.\w-_]*)?\??(?:[-\+=&;%@.\w_]*)#?(?:[\w]*))?)/,
  /** IP地址,如192.168.0.1 或8.8.8.8 */
  ipAddress:
    /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/,
  /** 11位手机号码 */
  mobileNo: /^1[0-9]{10}$/,
  /**7或8位的座机号(可带分机号),如0857-88084888-011*/
  telephoneNo: /^((0\d{2,3})[-,—]?)(\d{7,8})([-,—](\d{3}))?$/,
};
// /^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2]))$/,
